configuration/Catalogs/_Карточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>_Карточки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарточки_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыКарточки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКарточки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ВидыКарточек</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/InformationRegisters/_СостояниеКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_СостояниеКарточек</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеАктивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Карточка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД_Элемента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configuration/InformationRegisters/_ИсточникиФункциональныхРолей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_ИсточникиФункциональныхРолей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФункциональнаяРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ФункциональныеРоли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРеквизита</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРеквизитаДополнение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configuration/Enums/_СпособыГруппировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>_СпособыГруппировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВсеВместе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОдной</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Catalogs/_ФункциональныеРоли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>_ФункциональныеРоли</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарточки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ВидыКарточек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПроверкиОбработкиФР</Name>
					<Comment>Способ проверки/обработки финансовой роли</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыКарточки</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/Catalogs/_ВидыКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>_ВидыКарточек</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРеквизита</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранение</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
								<v8:Type>cfg:EnumRef._СпособыХранениеРеквизитовКарточки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизитаВХранении</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтартовоеДействие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Действия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтартовоеЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоФункциональнаяРоль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтображаемыеГруппыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппыКоманд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._КомандыГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыКарточки_родители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКарточки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ВидыКарточек</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/Catalogs/_Команды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>_Команды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._КомандыГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарточки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ВидыКарточек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФункциональныеРоли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФункциональнаяРоль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ФункциональныеРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособГруппировки</Name>
							<Type>
								<v8:Type>cfg:EnumRef._СпособыГруппировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/Catalogs/_Карточки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализация реквизита формы для хранения добавленных команд и кнопок
	// Используем ТаблицуЗначений, так как Соответствие не поддерживается в реквизитах формы
	//Если ДобавленныеКоманды = Неопределено Тогда
	//	// Создаем таблицу значений с колонками для хранения информации
	//	ДобавленныеКоманды = Новый ТаблицаЗначений;
	//	ДобавленныеКоманды.Колонки.Добавить("ИмяКнопки");
	//	ДобавленныеКоманды.Колонки.Добавить("КодКоманды");
	//	ДобавленныеКоманды.Колонки.Добавить("Команда"); // Ссылка на элемент справочника _Команды
	//	ДобавленныеКоманды.Колонки.Добавить("Группа");  // Ссылка на элемент справочника _КомандыГруппы
	//	ДобавленныеКоманды.Колонки.Добавить("ИмяГруппыФормы"); // Имя группы на форме, в которой находится кнопка
	//КонецЕсли;
	
	// Заполнение табличной части "Реквизиты" текущими значениями
	Если Объект.ВидыКарточки.Количество()>0 И ЗначениеЗаполнено(Объект.ВидыКарточки[0].ВидКарточки) Тогда
		
		// Создаем отбор для получения текущих значений реквизитов
		Отбор = Новый Соответствие();
		Отбор.Вставить("ВидКарточки", Объект.ВидыКарточки[0].ВидКарточки);
		Отбор.Вставить("Карточка", Объект.Ссылка);
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		// Получаем текущие значения реквизитов
		Значения = РегистрыСведений._СостояниеКарточек.ПолучитьСостояние(Отбор,,МенеджерВременныхТаблиц);
		
		// Очищаем таблицу "Реквизиты" формы
		Реквизиты.Очистить();
		
		// Заполняем таблицу "Реквизиты" полученными значениями
		Для Каждого Эл Из Значения Цикл
			СтрРеквизиты = Реквизиты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрРеквизиты, Эл);
			СтрРеквизиты.ЗначениеАктивно = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	// Обновляем список доступных команд
	ОбновитьСписокКоманд(МенеджерВременныхТаблиц);
	
КонецПроцедуры


#Область ЗаполнениеСпискаКоманд 
&НаСервере
Процедура ОбновитьСписокКоманд(МенеджерВременныхТаблиц)
	
	УдалитьДобавленныеКоманды();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Возврат; 
	КонецЕсли;
	
	Если Объект.ВидыКарточки.Количество() = 0 Тогда
		Сообщить("Не заполнена табличная часть 'ВидыКарточки'");
		Возврат; 
	КонецЕсли;
	
	// Создаю массив карточек основной функциональной роли
	Массив_ФункциональнаяРоль_Основная = Новый Массив;
	Массив_ФункциональнаяРоль_Основная.Добавить(Объект.Ссылка);
	
	Отбор_ФункциональнаяРоль_Основная = Новый Структура();
	Отбор_ФункциональнаяРоль_Основная.Вставить("ФункциональнаяРоль", Справочники._ФункциональныеРоли.ОсновнаяФР);
	Отбор_ФункциональнаяРоль_Основная.Вставить("Карточки", Массив_ФункциональнаяРоль_Основная);
	Отбор_ФункциональнаяРоль_Основная.Вставить("ПроверятьКакИ", Истина);
	
	Отбор_Карточки = Новый Массив;
	Отбор_Карточки.Добавить(Отбор_ФункциональнаяРоль_Основная);
	
	ОтборДляПоискаКоманд = Новый Структура("Карточки, ВидКарточки", Отбор_Карточки, Объект.ВидыКарточки[0].ВидКарточки);
	ОбновитьСписокКомандПоОтбору(ОтборДляПоискаКоманд);

	// Получаем команды с дополнительной функциональной ролью
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// Пакетный запрос: создает две временные таблицы и возвращает результат последнего ВЫБРАТЬ
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	_Команды.Группа КАК ГруппаКоманд,
		|	_Команды.Ссылка КАК Команда
		|ПОМЕСТИТЬ ВТ_КомандыДоступныеДляВидаКарточки
		|ИЗ
		|	Справочник._ВидыКарточек.ОтображаемыеГруппыКоманд КАК _ВидыКарточекОтображаемыеГруппыКоманд
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._Команды КАК _Команды
		|		ПО _ВидыКарточекОтображаемыеГруппыКоманд.ГруппыКоманд = _Команды.Группа
		|ГДЕ
		|	_ВидыКарточекОтображаемыеГруппыКоманд.Ссылка = &ВидКарточки
		|	И _Команды.ФункциональныеРоли.ФункциональнаяРоль = ЗНАЧЕНИЕ(Справочник._ФункциональныеРоли.ОсновнаяФР)
		|	И _Команды.ФункциональныеРоли.ВидКарточки_УДАЛИТЬ = &ВидКарточки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КомандыДоступныеДляВидаКарточки.Команда КАК Команда,
		|	_ИсточникиФункциональныхРолей.Команда КАК Команда1,
		|	_ИсточникиФункциональныхРолей.ФункциональнаяРоль КАК ФункциональнаяРоль,
		|	_ИсточникиФункциональныхРолей.ВидКарточки КАК ВидКарточки,
		|	_ИсточникиФункциональныхРолей.ВидРеквизита КАК ВидРеквизита,
		|	_ИсточникиФункциональныхРолей.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение
		|ПОМЕСТИТЬ ВТ_ИсточникиФункциональныхРолей
		|ИЗ
		|	ВТ_КомандыДоступныеДляВидаКарточки КАК ВТ_КомандыДоступныеДляВидаКарточки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений._ИсточникиФункциональныхРолей КАК _ИсточникиФункциональныхРолей
		|		ПО (_ИсточникиФункциональныхРолей.ВидКарточки = &ВидКарточки)
		|			И ВТ_КомандыДоступныеДляВидаКарточки.Команда = _ИсточникиФункциональныхРолей.Команда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ИсточникиФункциональныхРолей.Команда КАК Команда,
		|	ВТ_ИсточникиФункциональныхРолей.ФункциональнаяРоль КАК ФункциональнаяРоль,
		|	_КомандыФункциональныеРоли.СпособГруппировки КАК СпособГруппировки
		|ИЗ
		|	ВТ_ИсточникиФункциональныхРолей КАК ВТ_ИсточникиФункциональныхРолей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._Команды.ФункциональныеРоли КАК _КомандыФункциональныеРоли
		|		ПО ВТ_ИсточникиФункциональныхРолей.Команда = _КомандыФункциональныеРоли.Ссылка.Ссылка
		|			И ВТ_ИсточникиФункциональныхРолей.ФункциональнаяРоль = _КомандыФункциональныеРоли.ФункциональнаяРоль";
	
	Запрос.УстановитьПараметр("ВидКарточки", Объект.ВидыКарточки[0].ВидКарточки);
	
	// 1. Первое выполнение: создает временные таблицы и возвращает результат последнего ВЫБРАТЬ (уникальные команды)
	тзКоманды = Запрос.Выполнить().Выгрузить();
	
	// 2. Второе выполнение: меняем текст запроса на простой ВЫБРАТЬ из уже созданной временной таблицы.
	//    Это предотвращает ошибку "Временная таблица уже существует", так как мы больше не используем ПОМЕСТИТЬ.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Команда,
		|	ФункциональнаяРоль,
		|	ВидРеквизита,
		|	ВидРеквизитаДополнение
		|ИЗ
		|	ВТ_ИсточникиФункциональныхРолей";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	тзЗначенияФункциональныхРолей = Новый ТаблицаЗначений;
	тзЗначенияФункциональныхРолей.Колонки.Добавить("Команда");
	тзЗначенияФункциональныхРолей.Колонки.Добавить("ФункциональнаяРоль");
	тзЗначенияФункциональныхРолей.Колонки.Добавить("Значение");
	тзЗначенияФункциональныхРолей.Колонки.Добавить("УИД_Элемента");
	
	// 3. Перебираем детальные строки для формирования значений функциональных ролей
	Для Каждого Выборка Из РезультатЗапроса Цикл
			
		ОтборПоискаЗначенияФункциональнойРоли = Новый Структура("ВидРеквизита", Выборка.ВидРеквизита);
		Для Каждого ЗначениеФункциональнойРоли Из ЭтаФорма.Реквизиты.НайтиСтроки(ОтборПоискаЗначенияФункциональнойРоли) Цикл
			
			Если НЕ ЗначениеЗаполнено(Выборка.ВидРеквизитаДополнение) Тогда
				стрЗначения = тзЗначенияФункциональныхРолей.Добавить();
				стрЗначения.Команда = Выборка.Команда;
				стрЗначения.ФункциональнаяРоль = Выборка.ФункциональнаяРоль;
				стрЗначения.Значение = ЗначениеФункциональнойРоли.ЗначениеРеквизита;
				стрЗначения.УИД_Элемента = ЗначениеФункциональнойРоли.УИД_Элемента;
			Иначе
				Отбор = Новый Соответствие();
				Отбор.Вставить("Карточка", ЗначениеФункциональнойРоли.ЗначениеРеквизита);
				Отбор.Вставить("ВидКарточки", Отбор["Карточка"].ВидыКарточки[0].ВидКарточки);
				СостояниеСвязаннойКарточки = РегистрыСведений._СостояниеКарточек.ПолучитьСостояние(Отбор);
				
				Для Каждого СтрЗначенийРеквизита Из СостояниеСвязаннойКарточки Цикл
					Если СтрЗначенийРеквизита.ВидРеквизита <> Выборка.ВидРеквизитаДополнение Тогда
						Продолжить;
					КонецЕсли;
					стрЗначения = тзЗначенияФункциональныхРолей.Добавить();
					стрЗначения.Команда = Выборка.Команда;
					стрЗначения.ФункциональнаяРоль = Выборка.ФункциональнаяРоль;
					стрЗначения.Значение = СтрЗначенийРеквизита.ЗначениеРеквизита;
					стрЗначения.УИД_Элемента = СтрЗначенийРеквизита.УИД_Элемента;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	// Получаем таблицу всех готовых независимых комбинаций
	тзДляЗаполненияКомандФормы = ПодготовитьТЗДляЗаполненияКомандФормы(тзКоманды, тзЗначенияФункциональныхРолей);
	
	// Перебираем каждую готовую комбинацию
	Для Каждого стрКомбинации Из тзДляЗаполненияКомандФормы Цикл
		
		// Начинаем формировать отбор с основной роли
		Отбор_Карточки = Новый Массив;
		Отбор_Карточки.Добавить(Отбор_ФункциональнаяРоль_Основная);
		
		// Добавляем дополнительные роли из текущего набора комбинации
		Для Каждого стрЭлементНабора Из стрКомбинации.Набор Цикл
			
			// Если СпособГруппировки = "ВсеВместе", Значение уже является Массивом.
			// Если "ПоОдной", Значение — это одна ссылка, которую нужно обернуть в Массив, 
			// так как механизм получения команд ожидает именно Массив в ключе "Карточки".
			МассивКарточекДляРоли = стрЭлементНабора.Значение;
			Если ТипЗнч(МассивКарточекДляРоли) <> Тип("Массив") Тогда
				МассивКарточекДляРоли = Новый Массив;
				МассивКарточекДляРоли.Добавить(стрЭлементНабора.Значение);
			КонецЕсли;
			
			Отбор_ФункциональнаяРоль_Дополнительная = Новый Структура();
			Отбор_ФункциональнаяРоль_Дополнительная.Вставить("ФункциональнаяРоль", стрЭлементНабора.ФункциональнаяРоль);
			Отбор_ФункциональнаяРоль_Дополнительная.Вставить("Карточки", МассивКарточекДляРоли);
			Отбор_ФункциональнаяРоль_Дополнительная.Вставить("ПроверятьКакИ", Истина);
			
			Отбор_Карточки.Добавить(Отбор_ФункциональнаяРоль_Дополнительная);
			
		КонецЦикла;
		
		// Ищем и добавляем команды для этой конкретной комбинации ролей
		ОтборДляПоискаКоманд = Новый Структура("Карточки, ВидКарточки", Отбор_Карточки, Объект.ВидыКарточки[0].ВидКарточки);
		ОбновитьСписокКомандПоОтбору(ОтборДляПоискаКоманд);
		
	КонецЦикла;
	
КонецПроцедуры 

// Формирует таблицу значений всех возможных комбинаций функциональных ролей для команд.
// Алгоритм выполняет группировку входных данных по командам и функциональным ролям, 
// применяет заданный способ группировки и строит декартово произведение множеств 
// значений для получения всех уникальных комбинаций.
//
// Параметры:
//  ТаблицаКоманд       - ТаблицаЗначений - содержит колонки:
//                        * Команда (СправочникСсылка._Команды)
//                        * ФункциональнаяРоль (СправочникСсылка._ФункциональныеРоли)
//                        * СпособГруппировки (ПеречислениеСсылка._СпособыГруппировки)
//  ТаблицаЗначенийВход - ТаблицаЗначений - содержит колонки:
//                        * Команда (СправочникСсылка._Команды)
//                        * ФункциональнаяРоль (СправочникСсылка._ФункциональныеРоли)
//                        * Значение (Произвольный)
//                        * УИД_Элемента (Произвольный)
//
// Возвращаемое значение:
//  ТаблицаЗначений - с колонками:
//   * Команда (СправочникСсылка._Команды)
//   * Набор (Произвольный) - содержит Массив структур {ФункциональнаяРоль, Значение, УИД_Элемента}, 
//                            представляющий одну уникальную сгенерированную комбинацию.
//
&НаСервере
Функция ПодготовитьТЗДляЗаполненияКомандФормы(ТаблицаКоманд, ТаблицаЗначенийВход)
    
    ТЗРезультат = Новый ТаблицаЗначений;
    ТЗРезультат.Колонки.Добавить("Команда", Новый ОписаниеТипов("СправочникСсылка._Команды"));
    ТЗРезультат.Колонки.Добавить("Набор"); // Тип Произвольный, хранит Массив
    
    МассивКоманд = Новый Массив;
    СоответствиеКоманд = Новый Соответствие;
    
    // 1. Сбор уникальных команд и их функциональных ролей со способами группировки
    Для Каждого СтрокаКоманды Из ТаблицаКоманд Цикл
        
        ИмяКоманды = СтрокаКоманды.Команда;
        ФункциональнаяРоль = СтрокаКоманды.ФункциональнаяРоль;
        СпособГруппировки = СтрокаКоманды.СпособГруппировки;
        
        Если СоответствиеКоманд.Получить(ИмяКоманды) = Неопределено Тогда
            СоответствиеКоманд.Вставить(ИмяКоманды, Новый Массив);
            МассивКоманд.Добавить(ИмяКоманды);
        КонецЕсли;
        
        МассивУникальныхРолей = СоответствиеКоманд.Получить(ИмяКоманды);
        
        РольУжеЕсть = Ложь;
        Для Каждого СуществующаяРоль Из МассивУникальныхРолей Цикл
            Если СуществующаяРоль.ФункциональнаяРоль = ФункциональнаяРоль Тогда
                РольУжеЕсть = Истина;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        Если Не РольУжеЕсть Тогда
            МассивУникальныхРолей.Добавить(
                Новый Структура("ФункциональнаяРоль, СпособГруппировки", ФункциональнаяРоль, СпособГруппировки)
            );
        КонецЕсли;
        
    КонецЦикла;
    
    // 2. Формирование наборов данных для декартова произведения по каждой команде
    Для Каждого ИмяКоманды Из МассивКоманд Цикл
        
        МассивУникальныхРолей = СоответствиеКоманд.Получить(ИмяКоманды);
        МассивыПоРолям = Новый Массив;
        
        Для Каждого ЭлементРоли Из МассивУникальныхРолей Цикл
            
            ФункциональнаяРоль = ЭлементРоли.ФункциональнаяРоль;
            СпособГруппировки = ЭлементРоли.СпособГруппировки;
            
            ЗначенияРоли = Новый Массив;
            Для Каждого СтрокаЗначения Из ТаблицаЗначенийВход Цикл
                Если СтрокаЗначения.Команда = ИмяКоманды И СтрокаЗначения.ФункциональнаяРоль = ФункциональнаяРоль Тогда
                    ЗначенияРоли.Добавить(
                        Новый Структура("Значение, УИД_Элемента", СтрокаЗначения.Значение, СтрокаЗначения.УИД_Элемента)
                    );
                КонецЕсли;
            КонецЦикла;
            
            ЗначенияДляУмножения = Новый Массив;
            
            // Применение правила группировки
            Если СпособГруппировки = Перечисления._СпособыГруппировки.ВсеВместе Тогда
                МассивЗначений = Новый Массив;
                МассивУИДов = Новый Массив;
                Для Каждого ПараЗначений Из ЗначенияРоли Цикл
                    МассивЗначений.Добавить(ПараЗначений.Значение);
                    МассивУИДов.Добавить(ПараЗначений.УИД_Элемента);
                КонецЦикла;
                
                // Сворачиваем все значения в один элемент массива для умножения
                ЗначенияДляУмножения.Добавить(
                    Новый Структура("Значение, УИД_Элемента", МассивЗначений, МассивУИДов)
                );
            Иначе
                // Каждое значение участвует в умножении как отдельный элемент
                ЗначенияДляУмножения = ЗначенияРоли;
            КонецЕсли;
            
            МассивыПоРолям.Добавить(
                Новый Структура("ФункциональнаяРоль, Значения", ФункциональнаяРоль, ЗначенияДляУмножения)
            );
            
        КонецЦикла;
        
        // 3. Построение декартова произведения (итеративное раскрытие комбинаций)
        Комбинации = Новый Массив;
        Комбинации.Добавить(Новый Массив); // Начальное состояние: одна пустая комбинация
        
        Для Каждого ЭлементРоли Из МассивыПоРолям Цикл
            
            НовыеКомбинации = Новый Массив;
            
            Для Каждого Комбинация Из Комбинации Цикл
                Для Каждого ПараЗначений Из ЭлементРоли.Значения Цикл
                    
                    НоваяКомбинация = Новый Массив;
                    Для Каждого ЭлементКомбинации Из Комбинация Цикл
                        НоваяКомбинация.Добавить(ЭлементКомбинации);
                    КонецЦикла;
                    
                    НоваяКомбинация.Добавить(
                        Новый Структура("ФункциональнаяРоль, Значение, УИД_Элемента", 
                                        ЭлементРоли.ФункциональнаяРоль, 
                                        ПараЗначений.Значение, 
                                        ПараЗначений.УИД_Элемента)
                    );
                    
                    НовыеКомбинации.Добавить(НоваяКомбинация);
                    
                КонецЦикла;
            КонецЦикла;
            
            Комбинации = НовыеКомбинации;
            
        КонецЦикла;
        
        // 4. Запись сгенерированных комбинаций в результирующую таблицу значений
        Для Каждого Комбинация Из Комбинации Цикл
            НоваяСтрока = ТЗРезультат.Добавить();
            НоваяСтрока.Команда = ИмяКоманды;
            НоваяСтрока.Набор = Комбинация;
        КонецЦикла;
        
    КонецЦикла;
    
    Возврат ТЗРезультат;
    
КонецФункции

&НаСервере
Процедура ОбновитьСписокКомандПоОтбору(_ОтборПоискаДоступныхКоманд_)

	// Получаем список доступных команд
	СписокКоманд = Справочники._Команды.ПолучитьДоступныеКоманды(_ОтборПоискаДоступныхКоманд_);
	
	
	// Соответствие для отслеживания созданных групп команд
	// Ключ - ссылка на группу команды (_КомандыГруппы), Значение - имя группы на форме
	СозданныеГруппы = Новый Соответствие;
	
	// Проходим по списку доступных команд и создаем интерфейс
	Для Каждого ЭлементСписка Из СписокКоманд Цикл
		// Получаем саму ссылку на команду из структуры
		Команда = ЭлементСписка.Команда;
		// Получаем ссылку на группу команды из реквизита Группа справочника _Команды
		ГруппаКомандыСсылка = Команда.Группа;
		
		// Проверяем, что у команды установлена группа
		Если ЗначениеЗаполнено(ГруппаКомандыСсылка) Тогда
			
			// Проверяем, была ли уже создана группа для этой команды
			ИмяГруппыФормы = СозданныеГруппы.Получить(ГруппаКомандыСсылка);
			Если ИмяГруппыФормы = Неопределено Тогда
				
				// Формируем имя группы (подменю) для использования в интерфейсе формы
				// Используем уникальный идентификатор группы, заменив дефисы, чтобы избежать конфликта имен
				ИмяГруппыФормы = "ГруппаКоманд_" + СтрЗаменить(ГруппаКомандыСсылка.УникальныйИдентификатор(), "-", "");
				
				// Добавляем группу (подменю) в элементы формы (на командную панель)
				// Тип элемента - ГруппаФормы, Имя - уникальное, Родитель - заранее созданная группа на форме
				Если ЭтаФорма.ДобавленныеКоманды.НайтиСтроки(Новый Структура("ИмяГруппыФормы",ИмяГруппыФормы)).Количество() = 0 Тогда
					Группакоманд = Элементы.Добавить(ИмяГруппыФормы, Тип("ГруппаФормы"), Элементы.ГруппаКнопокКомандыДействий);
					Группакоманд.Заголовок = ГруппаКомандыСсылка.Наименование;
				Иначе
					Группакоманд = ЭтаФорма.Элементы[ИмяГруппыФормы];
				КонецЕсли;
				// Устанавливаем заголовок группы равным наименованию группы команд
				
				// Сохраняем имя созданной группы в соответствии
				СозданныеГруппы.Вставить(ГруппаКомандыСсылка, ИмяГруппыФормы);
			КонецЕсли;
			
            		
			СписокПредставленийДляФункциональныхРолей = новый Соответствие;
			// Формируем уникальное имя для команды кнопки
			КодКоманды = "Команда_" + СтрЗаменить(Команда.УникальныйИдентификатор(), "-", "") + "_" + СтрЗаменить(ГруппаКомандыСсылка.УникальныйИдентификатор(), "-", "");
			Для каждого ЭлементОтбора_Роль ИЗ _ОтборПоискаДоступныхКоманд_.Карточки Цикл
				Если ЭлементОтбора_Роль.ФункциональнаяРоль = Справочники._ФункциональныеРоли.ОсновнаяФР Тогда
					Продолжить;
				КонецЕсли;
				ОбработаннаяФункциональнаяРоль="невозможноеЗначение";
				Для каждого Роль_Команды ИЗ Команда.ФункциональныеРоли Цикл 
					Если ЭлементОтбора_Роль.ФункциональнаяРоль <> Роль_Команды.ФункциональнаяРоль 
					 ИЛИ ОбработаннаяФункциональнаяРоль = ЭлементОтбора_Роль.ФункциональнаяРоль 
					Тогда
						Продолжить;
					КонецЕсли;
					КодКоманды = КодКоманды+"_" + СтрЗаменить(ЭлементОтбора_Роль.ФункциональнаяРоль.УникальныйИдентификатор(), "-", "");
					Для Каждого ЭлементОтбора_Карточка ИЗ ЭлементОтбора_Роль.Карточки Цикл
						КодКоманды = КодКоманды+"_" + СтрЗаменить(ЭлементОтбора_Карточка.УникальныйИдентификатор(), "-", "");
					КонецЦикла;
					ОбработаннаяФункциональнаяРоль = ЭлементОтбора_Роль.ФункциональнаяРоль;
				КонецЦикла;
				
				//+Формирую представление текущей функциональной роли
				ТекстПредставления = "";
				Для Каждого Карточка ИЗ ЭлементОтбора_Роль.Карточки Цикл
					Если Карточка = Неопределено Тогда
						// Пустой список
						Продолжить;
					КонецЕсли;
					 ТекстПредставления = ТекстПредставления +", " + Карточка.Наименование;
				КонецЦикла;
				СписокПредставленийДляФункциональныхРолей.Вставить(
					ЭлементОтбора_Роль.ФункциональнаяРоль.Код,
					Сред(ТекстПредставления,3)
				);
				//-Формирую представление текущей функциональной роли
				
			КонецЦикла;
			
			//Запрос поиска правил написан таким образом, что при запросе с функциональными ролями будут возвращаться команды и без функциональных ролей
			//что бы исключить двойное добавление сделана эта проверка
			Если ЭтаФорма.ДобавленныеКоманды.НайтиСтроки(Новый Структура("КодКоманды",КодКоманды)).Количество() = 0 Тогда
				// Добавляем команду для кнопки в коллекцию команд формы
				НоваяКоманда = Команды.Добавить(КодКоманды);
				// Устанавливаем действие команды - вызов процедуры ОбработкаКомандыДействия
				// Это имя процедуры, которая будет выполнена при нажатии кнопки, связанной с командой
				НоваяКоманда.Действие = "ОбработкаКомандыДействия";
				
				// Уникальное имя для кнопки команды
				// Включает в себя часть от имени группы для уникальности
				ИмяКнопки = КодКоманды;
				
				// Добавляем кнопку в элементы формы
				// Тип элемента - КнопкаФормы, Имя - уникальное, Родитель - группа команды
				НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Группакоманд);
				// Устанавливаем имя команды для кнопки (связь с командой меню)
				НоваяКнопка.ИмяКоманды = КодКоманды;
				// Устанавливаем заголовок кнопки равным наименованию команды
				НоваяКнопка.Заголовок = Команда.Наименование;
				Для Каждого ЭлементПредставления ИЗ СписокПредставленийДляФункциональныхРолей Цикл 
					НоваяКнопка.Заголовок = СтрЗаменить(НоваяКнопка.Заголовок,"*"+ЭлементПредставления.Ключ+"*",ЭлементПредставления.Значение);
				КонецЦикла;
				
				// Сохраняем информацию о добавленной кнопке и связанной с ней команде в Таблице Значений
				НоваяСтрока = ДобавленныеКоманды.Добавить();
				НоваяСтрока.ИмяКнопки = ИмяКнопки;
				НоваяСтрока.КодКоманды=КодКоманды;
				НоваяСтрока.Команда = Команда;
				НоваяСтрока.Группа = ГруппаКомандыСсылка;
				НоваяСтрока.ИмяГруппыФормы = ИмяГруппыФормы;
				НоваяСтрока.ОтборПоискаДоступныхКоманд = _ОтборПоискаДоступныхКоманд_;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДобавленныеКоманды()
	
	// Для корректного удаления пустых групп после кнопок,
	// запоминаем имена всех динамически добавленных групп.
	// Создадим соответствие для хранения уникальных имен групп.
	УникальныеИменаГрупп = Новый Соответствие;
	
	// Проходим по всем ранее добавленным командам и удаляем соответствующие элементы интерфейса
	// Используем итерацию с конца, чтобы избежать проблем с изменением исходной таблицы во время итерации
	
	// Получаем исходное количество строк
	ИсходноеКоличество = ДобавленныеКоманды.Количество();
	
	// Итерируемся от последней строки к первой (от большего индекса к меньшему)
	// Индексация строк в ТаблицеЗначений начинается с 0
	Для Счетчик = 0 По ИсходноеКоличество - 1 Цикл
		// Получаем строку, начиная с конца
		// Индекс строки для удаления = (ИсходноеКоличество - 1) - Счетчик
		ИндексДляУдаления = (ИсходноеКоличество - 1) - Счетчик;
		ТекущаяСтрока = ДобавленныеКоманды[ИндексДляУдаления];
		
		ИмяКнопки = ТекущаяСтрока.ИмяКнопки;
		// Удаляем команду, связанную с кнопкой, из коллекции команд формы
		// Для этого сначала нужно получить имя команды по имени кнопки
		ИмяКоманды = Элементы[ИмяКнопки].ИмяКоманды;
		Команды.Удалить(Команды[ИмяКоманды]);
		
		// Удаляем кнопку из элементов формы
		Элементы.Удалить( Элементы[ИмяКнопки]);
		
		// Запоминаем имя группы, к которой принадлежала кнопка, для последующего удаления пустой группы
		ИмяГруппыФормы = ТекущаяСтрока.ИмяГруппыФормы;
		// Проверяем, что имя группы заполнено и еще не было добавлено в соответствие
		// Проверка наличия ключа осуществляется с помощью метода Получить()
		Если ЗначениеЗаполнено(ИмяГруппыФормы) И УникальныеИменаГрупп.Получить(ИмяГруппыФормы) = Неопределено Тогда
			УникальныеИменаГрупп.Вставить(ИмяГруппыФормы, Истина); // Значение произвольное
		КонецЕсли;
		
		// Удаляем информацию о кнопке из реквизита формы (таблицы значений)
		// Это нужно делать *до* проверки необходимости удаления группы, чтобы не учитывать её
		ДобавленныеКоманды.Удалить(ТекущаяСтрока);
		
	КонецЦикла;
	
	// После удаления всех кнопок, удаляем пустые группы.
	// Проходимся по списку уникальных имен групп, которые были затронуты.
	Для Каждого КлючИзСоответствия Из УникальныеИменаГрупп Цикл
		ИмяГруппыФормы = КлючИзСоответствия.Ключ;
		
		// Проверяем, остались ли подчинённые элементы у этой группы в элементах формы
		// Получаем сам элемент группы из элементов формы по имени
		ЭлементГруппы = Элементы[ИмяГруппыФормы];
		
		// Убеждаемся, что элемент существует и является группой
		Если ТипЗнч(ЭлементГруппы) = Тип("ГруппаФормы") Тогда
			// Получаем коллекцию 
			//Подчиненные = ЭлементГруппы.ПодчиненныеЭлементы; //Ошибка. попытка переопределить предопределенный элемент
			// Считаем количество подчинённых элементов
			КоличествоПодчиненных = ЭлементГруппы.ПодчиненныеЭлементы.Количество();
			
			// Если подчинённых элементов нет, удаляем группу и связанную с ней команду
			Если КоличествоПодчиненных = 0 Тогда
				// Удаляем команду, связанную с группой
				// Для этого получаем имя команды из элемента группы
				//ИмяКомандыГруппы = ЭлементГруппы.ИмяКоманды;  //Тупой ИИ. Решил, что у группы кнопок должна быть команда
				//Команды.Удалить(ИмяКомандыГруппы);
				
				// Удаляем группу из элементов формы
				Элементы.Удалить(Элементы[ИмяГруппыФормы]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// После удаления всех элементов и групп, очищаем таблицу значений
	// (хотя она уже должна быть пустой к этому моменту)
	ДобавленныеКоманды.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыДействия(Команда)
	
	// Получаем информацию о команде из реквизита формы (таблицы значений) по имени нажатой кнопки
	// Для этого сначала получим имя кнопки из параметра
	КодКоманды = Команда.Имя;
	МассивСтрок = ДобавленныеКоманды.НайтиСтроки(Новый Структура("КодКоманды",КодКоманды));
	
	// Проверяем, что информация о команде была найдена
	Для Каждого ОписаниеКоманды Из МассивСтрок Цикл
		
		////Создаю массив карточек основной функциональной роли
		//Массив_ФункциональнаяРоль_Основная = Новый Массив;
		//Массив_ФункциональнаяРоль_Основная.Добавить(Объект.Ссылка);
		////Делаю полное описание основной функциональной роли
		//Отбор_ФункциональнаяРоль_Основная = Новый Структура();
		//Отбор_ФункциональнаяРоль_Основная.Вставить("ФункциональнаяРоль",ПредопределенноеЗначение("Справочник._ФункциональныеРоли.ОсновнаяФР"));
		//Отбор_ФункциональнаяРоль_Основная.Вставить("Карточки",Массив_ФункциональнаяРоль_Основная);
		//Отбор_ФункциональнаяРоль_Основная.Вставить("ПроверятьКакИ",Истина);
		////Подготавливаю масив проверяемых карточек в соответствии с их функциональными ролями	
		//Отбор_Карточки = Новый Массив;
		//Отбор_Карточки.Добавить(Отбор_ФункциональнаяРоль_Основная);

		//Отбор = Новый Структура("Карточки,ВидКарточки,Команды",Отбор_Карточки,Объект_ВидКарточки(),Отбор_Команды);
		
		
		Массив_Команды = Новый Массив;
		Массив_Команды.Добавить(ОписаниеКоманды.Команда);
		ОтборПоискаКоманды = ОписаниеКоманды.ОтборПоискаДоступныхКоманд;
		ОтборПоискаКоманды.Вставить("Команды",Массив_Команды);
	
		_КомандыКлиент.ВыполнитьКоманду(ЭтаФорма,ОтборПоискаКоманды);

		// Здесь должна быть реализация вызова команды
		// Пока что просто выводим сообщение
		Сообщить("Вызвана команда: " + Команда );
		
		Прервать;
	КонецЦикла;
	
	// Также обновляем таблицу реквизитов
	ПриСозданииНаСервере(Ложь, Истина);
	
КонецПроцедуры

&НаСервере
Функция Объект_ВидКарточки()
	Возврат Объект.Ссылка.ВидыКарточки[0].ВидКарточки;
КонецФункции
#КонецОбласти 

&НаКлиенте
Процедура РеквизитыВидРеквизитаПриИзменении(Элемент)
	ТекущиеДанные = ЭтотОбъект.Элементы.Реквизиты.ТекущиеДанные;
	Если _ВызовСервера.ПолучитьЗначение(ТекущиеДанные.ВидРеквизита,"ЭтоСписок") И НЕ ЗначениеЗаполнено(ТекущиеДанные.УИД_Элемента) Тогда
		ТекущиеДанные.УИД_Элемента = Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СохраняемыеРеквизиты",ЭтаФорма.Реквизиты);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Объект.ВидКарточки_Представление ="";
	//Для каждого стрВидКарточки Из Объект.ВидыКарточки Цикл
	//	Объект.ВидКарточки_Представление = Объект.ВидКарточки_Представление+" ;"+стрВидКарточки.ВидКарточки;	
	//КонецЦикла;
	//Объект.ВидКарточки_Представление = Сред(Объект.ВидКарточки_Представление,2);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование И НоваяСтрока Тогда
		Элемент.ТекущиеДанные.УИД_Элемента = Новый УникальныйИдентификатор;
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	ПриСозданииНаСервере(Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыЗначениеАктивноНажатие(Элемент, СтандартнаяОбработка)
	й =1;
КонецПроцедуры
